app/Controllers/Admin.php

    public function index()
    {
        $session = session();
        if ($session->logged_in == false && $session->tipo_usuari == 0) {
            return redirect()->to('/');
        }
        $model = new Usuari();
        $modelActivitat = new Activitat();
        $modelCategoria = new Categoria();
        $modelSubcategoria = new Subcategoria();
        $activitats = $modelActivitat->findAll();
        $usuaris = $model->findAll();
        $categorias = $modelCategoria->findAll();
        $subcategorias = $modelSubcategoria->findAll();
---
SELECT *
FROM `activitat`
SELECT *
FROM `usuari`
SELECT *
FROM `categoria`
SELECT *
FROM `subcategoria`