app/Controllers/Index.php

    public function experiencias()
    {
        $model = new Subcategoria();
        $modelAct = new Activitat();
        $dades = [
            'aerea' => $model->where('id_categoria', 1)->findAll(),
            'terrestre' => $model->where('id_categoria', 2)->findAll(),
            'acuatica' => $model->where('id_categoria', 3)->findAll(),
            'viajes' => $model->where('id_categoria', 4)->findAll(),
---
SELECT *
FROM `subcategoria`
WHERE `id_categoria` = 1