app/Controllers/Index.php

    public function perfil()
    {
        $session = session();
        $model = new Subcategoria();
        $dades = ['aerea' => $model->where('id_categoria', 1)->findAll(), 'terrestre' => $model->where('id_categoria', 2)->findAll(), 'acuatica' => $model->where('id_categoria', 3)->findAll(), 'viajes' => $model->where('id_categoria', 4)->findAll()];
        if ($session->logged_in == false) {
            return redirect()->to('/');
        }
        else {
            $model = new Usuari();
            $usuari = $model->find($session->id);
---
SELECT *
FROM `subcategoria`
WHERE `id_categoria` = 1
SELECT *
FROM `usuari`
WHERE `usuari`.`id` = '23'

    public function experiencias()
    {
        $model = new Subcategoria();
        $modelAct = new Activitat();
        $dades = [
            'aerea' => $model->where('id_categoria', 1)->findAll(),
            'terrestre' => $model->where('id_categoria', 2)->findAll(),
            'acuatica' => $model->where('id_categoria', 3)->findAll(),
            'viajes' => $model->where('id_categoria', 4)->findAll(),
            'aerea_content' => $modelAct->where('categoria', 'aerea')->findAll(),
            'terrestre_content' => $modelAct->where('categoria', 'terrestre')->findAll(),
            'acuatica_content' => $modelAct->where('categoria', 'acuatica')->findAll(),
            'viajes_content' => $modelAct->where('categoria', 'viajes')->findAll(),
---
SELECT *
FROM `subcategoria`
WHERE `id_categoria` = 2
SELECT *
FROM `subcategoria`
WHERE `id_categoria` = 3
SELECT *
FROM `subcategoria`
WHERE `id_categoria` = 4
SELECT *
FROM `activitat`
WHERE `categoria` = 'aerea'
SELECT *
FROM `activitat`
WHERE `categoria` = 'terrestre'
SELECT *
FROM `activitat`
WHERE `categoria` = 'acuatica'
SELECT *
FROM `activitat`
WHERE `categoria` = 'viajes'